luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_bf.h
/** \brief  Offset for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL7 */
#define IFX_GTM_ADCTRIG0OUT0_SEL7_OFF (28u)

/** \brief  Length for Ifx_GTM_ADCTRIG0OUT1_Bits.SEL0 */
#define IFX_GTM_ADCTRIG0OUT1_SEL0_LEN (4u)

/** \brief  Mask for Ifx_GTM_ADCTRIG0OUT1_Bits.SEL0 */
#define IFX_GTM_ADCTRIG0OUT1_SEL0_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_ADCTRIG0OUT1_Bits.SEL0 */
#define IFX_GTM_ADCTRIG0OUT1_SEL0_OFF (0u)

/** \brief  Length for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL0 */
#define IFX_GTM_ADCTRIG1OUT0_SEL0_LEN (4u)

/** \brief  Mask for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL0 */
#define IFX_GTM_ADCTRIG1OUT0_SEL0_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL0 */
#define IFX_GTM_ADCTRIG1OUT0_SEL0_OFF (0u)

/** \brief  Length for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL1 */
#define IFX_GTM_ADCTRIG1OUT0_SEL1_LEN (4u)

/** \brief  Mask for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL1 */
#define IFX_GTM_ADCTRIG1OUT0_SEL1_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL1 */
#define IFX_GTM_ADCTRIG1OUT0_SEL1_OFF (4u)

/** \brief  Length for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL2 */
#define IFX_GTM_ADCTRIG1OUT0_SEL2_LEN (4u)

/** \brief  Mask for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL2 */
#define IFX_GTM_ADCTRIG1OUT0_SEL2_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL2 */
#define IFX_GTM_ADCTRIG1OUT0_SEL2_OFF (8u)

/** \brief  Length for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL3 */
#define IFX_GTM_ADCTRIG1OUT0_SEL3_LEN (4u)

/** \brief  Mask for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL3 */
#define IFX_GTM_ADCTRIG1OUT0_SEL3_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL3 */
#define IFX_GTM_ADCTRIG1OUT0_SEL3_OFF (12u)

/** \brief  Length for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL4 */
#define IFX_GTM_ADCTRIG1OUT0_SEL4_LEN (4u)

/** \brief  Mask for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL4 */
#define IFX_GTM_ADCTRIG1OUT0_SEL4_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL4 */
#define IFX_GTM_ADCTRIG1OUT0_SEL4_OFF (16u)

/** \brief  Length for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL5 */
#define IFX_GTM_ADCTRIG1OUT0_SEL5_LEN (4u)

/** \brief  Mask for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL5 */
#define IFX_GTM_ADCTRIG1OUT0_SEL5_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL5 */
#define IFX_GTM_ADCTRIG1OUT0_SEL5_OFF (20u)

/** \brief  Length for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL6 */
#define IFX_GTM_ADCTRIG1OUT0_SEL6_LEN (4u)

/** \brief  Mask for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL6 */
#define IFX_GTM_ADCTRIG1OUT0_SEL6_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL6 */
#define IFX_GTM_ADCTRIG1OUT0_SEL6_OFF (24u)

/** \brief  Length for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL7 */
#define IFX_GTM_ADCTRIG1OUT0_SEL7_LEN (4u)

/** \brief  Mask for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL7 */
#define IFX_GTM_ADCTRIG1OUT0_SEL7_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL7 */
#define IFX_GTM_ADCTRIG1OUT0_SEL7_OFF (28u)

/** \brief  Length for Ifx_GTM_ADCTRIG1OUT1_Bits.SEL0 */
#define IFX_GTM_ADCTRIG1OUT1_SEL0_LEN (4u)

/** \brief  Mask for Ifx_GTM_ADCTRIG1OUT1_Bits.SEL0 */
#define IFX_GTM_ADCTRIG1OUT1_SEL0_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_ADCTRIG1OUT1_Bits.SEL0 */
#define IFX_GTM_ADCTRIG1OUT1_SEL0_OFF (0u)

/** \brief  Length for Ifx_GTM_AEI_ADDR_XPT_Bits.TO_ADDR */
#define IFX_GTM_AEI_ADDR_XPT_TO_ADDR_LEN (20u)

/** \brief  Mask for Ifx_GTM_AEI_ADDR_XPT_Bits.TO_ADDR */
#define IFX_GTM_AEI_ADDR_XPT_TO_ADDR_MSK (0xfffffu)

/** \brief  Offset for Ifx_GTM_AEI_ADDR_XPT_Bits.TO_ADDR */
#define IFX_GTM_AEI_ADDR_XPT_TO_ADDR_OFF (0u)

/** \brief  Length for Ifx_GTM_AEI_ADDR_XPT_Bits.TO_W1R0 */
#define IFX_GTM_AEI_ADDR_XPT_TO_W1R0_LEN (1u)

/** \brief  Mask for Ifx_GTM_AEI_ADDR_XPT_Bits.TO_W1R0 */
#define IFX_GTM_AEI_ADDR_XPT_TO_W1R0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_AEI_ADDR_XPT_Bits.TO_W1R0 */
#define IFX_GTM_AEI_ADDR_XPT_TO_W1R0_OFF (20u)

/** \brief  Length for Ifx_GTM_AFD_CH_BUF_ACC_Bits.DATA */
#define IFX_GTM_AFD_CH_BUF_ACC_DATA_LEN (29u)

/** \brief  Mask for Ifx_GTM_AFD_CH_BUF_ACC_Bits.DATA */
#define IFX_GTM_AFD_CH_BUF_ACC_DATA_MSK (0x1fffffffu)

/** \brief  Offset for Ifx_GTM_AFD_CH_BUF_ACC_Bits.DATA */
#define IFX_GTM_AFD_CH_BUF_ACC_DATA_OFF (0u)

/** \brief  Length for Ifx_GTM_ARU_ARU_ACCESS_Bits.ADDR */
#define IFX_GTM_ARU_ARU_ACCESS_ADDR_LEN (9u)

/** \brief  Mask for Ifx_GTM_ARU_ARU_ACCESS_Bits.ADDR */
#define IFX_GTM_ARU_ARU_ACCESS_ADDR_MSK (0x1ffu)

/** \brief  Offset for Ifx_GTM_ARU_ARU_ACCESS_Bits.ADDR */
#define IFX_GTM_ARU_ARU_ACCESS_ADDR_OFF (0u)

/** \brief  Length for Ifx_GTM_ARU_ARU_ACCESS_Bits.RREQ */
#define IFX_GTM_ARU_ARU_ACCESS_RREQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ARU_ARU_ACCESS_Bits.RREQ */
#define IFX_GTM_ARU_ARU_ACCESS_RREQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ARU_ARU_ACCESS_Bits.RREQ */
#define IFX_GTM_ARU_ARU_ACCESS_RREQ_OFF (12u)

/** \brief  Length for Ifx_GTM_ARU_ARU_ACCESS_Bits.WREQ */
#define IFX_GTM_ARU_ARU_ACCESS_WREQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ARU_ARU_ACCESS_Bits.WREQ */
#define IFX_GTM_ARU_ARU_ACCESS_WREQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ARU_ARU_ACCESS_Bits.WREQ */
#define IFX_GTM_ARU_ARU_ACCESS_WREQ_OFF (13u)

/** \brief  Length for Ifx_GTM_ARU_DATA_H_Bits.DATA */
#define IFX_GTM_ARU_DATA_H_DATA_LEN (29u)

/** \brief  Mask for Ifx_GTM_ARU_DATA_H_Bits.DATA */
#define IFX_GTM_ARU_DATA_H_DATA_MSK (0x1fffffffu)

/** \brief  Offset for Ifx_GTM_ARU_DATA_H_Bits.DATA */
#define IFX_GTM_ARU_DATA_H_DATA_OFF (0u)

/** \brief  Length for Ifx_GTM_ARU_DATA_L_Bits.DATA */
#define IFX_GTM_ARU_DATA_L_DATA_LEN (29u)

/** \brief  Mask for Ifx_GTM_ARU_DATA_L_Bits.DATA */
#define IFX_GTM_ARU_DATA_L_DATA_MSK (0x1fffffffu)

/** \brief  Offset for Ifx_GTM_ARU_DATA_L_Bits.DATA */
#define IFX_GTM_ARU_DATA_L_DATA_OFF (0u)

/** \brief  Length for Ifx_GTM_ARU_DBG_ACCESS0_Bits.ADDR */
#define IFX_GTM_ARU_DBG_ACCESS0_ADDR_LEN (9u)

/** \brief  Mask for Ifx_GTM_ARU_DBG_ACCESS0_Bits.ADDR */
#define IFX_GTM_ARU_DBG_ACCESS0_ADDR_MSK (0x1ffu)

/** \brief  Offset for Ifx_GTM_ARU_DBG_ACCESS0_Bits.ADDR */
#define IFX_GTM_ARU_DBG_ACCESS0_ADDR_OFF (0u)

/** \brief  Length for Ifx_GTM_ARU_DBG_ACCESS1_Bits.ADDR */
#define IFX_GTM_ARU_DBG_ACCESS1_ADDR_LEN (9u)

/** \brief  Mask for Ifx_GTM_ARU_DBG_ACCESS1_Bits.ADDR */
#define IFX_GTM_ARU_DBG_ACCESS1_ADDR_MSK (0x1ffu)

/** \brief  Offset for Ifx_GTM_ARU_DBG_ACCESS1_Bits.ADDR */
#define IFX_GTM_ARU_DBG_ACCESS1_ADDR_OFF (0u)

/** \brief  Length for Ifx_GTM_ARU_DBG_DATA0_H_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA0_H_DATA_LEN (29u)

/** \brief  Mask for Ifx_GTM_ARU_DBG_DATA0_H_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA0_H_DATA_MSK (0x1fffffffu)

