luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_bf.h
/** \brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DEST_ERR */
#define IFX_GTM_BRC_IRQ_NOTIFY_DEST_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DEST_ERR */
#define IFX_GTM_BRC_IRQ_NOTIFY_DEST_ERR_OFF (0u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID0 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID0_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID0 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID0 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID0_OFF (1u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID10 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID10_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID10 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID10_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID10 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID10_OFF (11u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID11 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID11_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID11 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID11_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID11 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID11_OFF (12u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID1 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID1_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID1 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID1 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID1_OFF (2u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID2 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID2_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID2 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID2 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID2_OFF (3u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID3 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID3_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID3 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID3 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID3_OFF (4u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID4 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID4_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID4 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID4_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID4 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID4_OFF (5u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID5 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID5_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID5 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID5_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID5 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID5_OFF (6u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID6 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID6_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID6 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID6_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID6 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID6_OFF (7u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID7 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID7_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID7 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID7_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID7 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID7_OFF (8u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID8 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID8_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID8 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID8_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID8 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID8_OFF (9u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID9 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID9_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID9 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID9_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID9 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID9_OFF (10u)

/** \brief  Length for Ifx_GTM_BRC_RST_Bits.RST */
#define IFX_GTM_BRC_RST_RST_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_RST_Bits.RST */
#define IFX_GTM_BRC_RST_RST_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_RST_Bits.RST */
#define IFX_GTM_BRC_RST_RST_OFF (0u)

/** \brief  Length for Ifx_GTM_BRC_SRC0_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC0_ADDR_ADDR_LEN (9u)

/** \brief  Mask for Ifx_GTM_BRC_SRC0_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC0_ADDR_ADDR_MSK (0x1ffu)

/** \brief  Offset for Ifx_GTM_BRC_SRC0_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC0_ADDR_ADDR_OFF (0u)

/** \brief  Length for Ifx_GTM_BRC_SRC0_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC0_ADDR_BRC_MODE_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC0_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC0_ADDR_BRC_MODE_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC0_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC0_ADDR_BRC_MODE_OFF (12u)

/** \brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST0_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST0_OFF (0u)

/** \brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST10_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST10_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST10_OFF (10u)

/** \brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST11_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST11_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST11_OFF (11u)

/** \brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST12_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST12_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST12_OFF (12u)

/** \brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST13 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST13_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST13 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST13_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST13 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST13_OFF (13u)

