luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_bf.h
/** \brief  Mask for Ifx_GTM_BRC_SRC3_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC3_ADDR_ADDR_MSK (0x1ffu)

/** \brief  Offset for Ifx_GTM_BRC_SRC3_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC3_ADDR_ADDR_OFF (0u)

/** \brief  Length for Ifx_GTM_BRC_SRC3_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC3_ADDR_BRC_MODE_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC3_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC3_ADDR_BRC_MODE_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC3_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC3_ADDR_BRC_MODE_OFF (12u)

/** \brief  Length for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST0_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST0_OFF (0u)

/** \brief  Length for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST10_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST10_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST10_OFF (10u)

/** \brief  Length for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST11_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST11_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST11_OFF (11u)

/** \brief  Length for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST12_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST12_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST12_OFF (12u)

/** \brief  Length for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST13 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST13_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST13 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST13_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST13 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST13_OFF (13u)

/** \brief  Length for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST14 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST14_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST14 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST14_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST14 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST14_OFF (14u)

/** \brief  Length for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST15 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST15_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST15 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST15_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST15 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST15_OFF (15u)

/** \brief  Length for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST16 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST16_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST16 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST16_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST16 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST16_OFF (16u)

/** \brief  Length for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST17 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST17_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST17 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST17_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST17 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST17_OFF (17u)

/** \brief  Length for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST18 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST18_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST18 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST18_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST18 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST18_OFF (18u)

/** \brief  Length for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST19 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST19_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST19 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST19_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST19 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST19_OFF (19u)

/** \brief  Length for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST1 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST1_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST1 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST1 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST1_OFF (1u)

/** \brief  Length for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST20 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST20_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST20 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST20_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST20 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST20_OFF (20u)

/** \brief  Length for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST21 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST21_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST21 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST21_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST21 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST21_OFF (21u)

/** \brief  Length for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST2 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST2_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST2 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST2 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST2_OFF (2u)

/** \brief  Length for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST3_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST3_OFF (3u)

/** \brief  Length for Ifx_GTM_BRC_SRC3_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC3_DEST_EN_DEST4_LEN (1u)

