luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_bf.h
/** \brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC10_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC10_EN_EIRQ_OFF (22u)

/** \brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC11_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC11_EN_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC11_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC11_EN_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC11_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC11_EN_EIRQ_OFF (23u)

/** \brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC1_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC1_EN_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC1_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC1_EN_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC1_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC1_EN_EIRQ_OFF (13u)

/** \brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC2_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC2_EN_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC2_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC2_EN_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC2_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC2_EN_EIRQ_OFF (14u)

/** \brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC3_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC3_EN_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC3_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC3_EN_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC3_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC3_EN_EIRQ_OFF (15u)

/** \brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC4_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC4_EN_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC4_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC4_EN_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC4_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC4_EN_EIRQ_OFF (16u)

/** \brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC5_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC5_EN_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC5_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC5_EN_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC5_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC5_EN_EIRQ_OFF (17u)

/** \brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC6_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC6_EN_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC6_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC6_EN_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC6_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC6_EN_EIRQ_OFF (18u)

/** \brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC7_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC7_EN_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC7_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC7_EN_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC7_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC7_EN_EIRQ_OFF (19u)

/** \brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC8_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC8_EN_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC8_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC8_EN_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC8_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC8_EN_EIRQ_OFF (20u)

/** \brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC9_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC9_EN_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC9_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC9_EN_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC9_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC9_EN_EIRQ_OFF (21u)

/** \brief  Length for Ifx_GTM_CMP_EN_Bits.ABWC0_EN */
#define IFX_GTM_CMP_EN_ABWC0_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EN_Bits.ABWC0_EN */
#define IFX_GTM_CMP_EN_ABWC0_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EN_Bits.ABWC0_EN */
#define IFX_GTM_CMP_EN_ABWC0_EN_OFF (0u)

/** \brief  Length for Ifx_GTM_CMP_EN_Bits.ABWC10_EN */
#define IFX_GTM_CMP_EN_ABWC10_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EN_Bits.ABWC10_EN */
#define IFX_GTM_CMP_EN_ABWC10_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EN_Bits.ABWC10_EN */
#define IFX_GTM_CMP_EN_ABWC10_EN_OFF (10u)

/** \brief  Length for Ifx_GTM_CMP_EN_Bits.ABWC11_EN */
#define IFX_GTM_CMP_EN_ABWC11_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EN_Bits.ABWC11_EN */
#define IFX_GTM_CMP_EN_ABWC11_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EN_Bits.ABWC11_EN */
#define IFX_GTM_CMP_EN_ABWC11_EN_OFF (11u)

/** \brief  Length for Ifx_GTM_CMP_EN_Bits.ABWC1_EN */
#define IFX_GTM_CMP_EN_ABWC1_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EN_Bits.ABWC1_EN */
#define IFX_GTM_CMP_EN_ABWC1_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EN_Bits.ABWC1_EN */
#define IFX_GTM_CMP_EN_ABWC1_EN_OFF (1u)

/** \brief  Length for Ifx_GTM_CMP_EN_Bits.ABWC2_EN */
#define IFX_GTM_CMP_EN_ABWC2_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EN_Bits.ABWC2_EN */
#define IFX_GTM_CMP_EN_ABWC2_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EN_Bits.ABWC2_EN */
#define IFX_GTM_CMP_EN_ABWC2_EN_OFF (2u)

/** \brief  Length for Ifx_GTM_CMP_EN_Bits.ABWC3_EN */
#define IFX_GTM_CMP_EN_ABWC3_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EN_Bits.ABWC3_EN */
#define IFX_GTM_CMP_EN_ABWC3_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EN_Bits.ABWC3_EN */
#define IFX_GTM_CMP_EN_ABWC3_EN_OFF (3u)

/** \brief  Length for Ifx_GTM_CMP_EN_Bits.ABWC4_EN */
#define IFX_GTM_CMP_EN_ABWC4_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EN_Bits.ABWC4_EN */
#define IFX_GTM_CMP_EN_ABWC4_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EN_Bits.ABWC4_EN */
#define IFX_GTM_CMP_EN_ABWC4_EN_OFF (4u)

/** \brief  Length for Ifx_GTM_CMP_EN_Bits.ABWC5_EN */
#define IFX_GTM_CMP_EN_ABWC5_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EN_Bits.ABWC5_EN */
#define IFX_GTM_CMP_EN_ABWC5_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EN_Bits.ABWC5_EN */
#define IFX_GTM_CMP_EN_ABWC5_EN_OFF (5u)

/** \brief  Length for Ifx_GTM_CMP_EN_Bits.ABWC6_EN */
#define IFX_GTM_CMP_EN_ABWC6_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EN_Bits.ABWC6_EN */
#define IFX_GTM_CMP_EN_ABWC6_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EN_Bits.ABWC6_EN */
#define IFX_GTM_CMP_EN_ABWC6_EN_OFF (6u)

/** \brief  Length for Ifx_GTM_CMP_EN_Bits.ABWC7_EN */
#define IFX_GTM_CMP_EN_ABWC7_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_CMP_EN_Bits.ABWC7_EN */
#define IFX_GTM_CMP_EN_ABWC7_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_CMP_EN_Bits.ABWC7_EN */
#define IFX_GTM_CMP_EN_ABWC7_EN_OFF (7u)

