luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_bf.h
/** \brief  Mask for Ifx_GTM_DPLL_APT_Bits.APT_2B */
#define IFX_GTM_DPLL_APT_APT_2B_MSK (0x3ffu)

/** \brief  Offset for Ifx_GTM_DPLL_APT_Bits.APT_2B */
#define IFX_GTM_DPLL_APT_APT_2B_OFF (14u)

/** \brief  Length for Ifx_GTM_DPLL_APT_Bits.APT */
#define IFX_GTM_DPLL_APT_APT_LEN (10u)

/** \brief  Mask for Ifx_GTM_DPLL_APT_Bits.APT */
#define IFX_GTM_DPLL_APT_APT_MSK (0x3ffu)

/** \brief  Offset for Ifx_GTM_DPLL_APT_Bits.APT */
#define IFX_GTM_DPLL_APT_APT_OFF (2u)

/** \brief  Length for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_EXT */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_EXT_LEN (6u)

/** \brief  Mask for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_EXT */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_EXT_MSK (0x3fu)

/** \brief  Offset for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_EXT */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_EXT_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_OLD */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_OLD_LEN (10u)

/** \brief  Mask for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_OLD */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_OLD_MSK (0x3ffu)

/** \brief  Offset for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_OLD */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_OLD_OFF (14u)

/** \brief  Length for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_STATUS */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_STATUS_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_STATUS */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_STATUS_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_STATUS */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_STATUS_OFF (6u)

/** \brief  Length for Ifx_GTM_DPLL_APT_Bits.WAPT_2B */
#define IFX_GTM_DPLL_APT_WAPT_2B_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_APT_Bits.WAPT_2B */
#define IFX_GTM_DPLL_APT_WAPT_2B_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_APT_Bits.WAPT_2B */
#define IFX_GTM_DPLL_APT_WAPT_2B_OFF (13u)

/** \brief  Length for Ifx_GTM_DPLL_APT_Bits.WAPT */
#define IFX_GTM_DPLL_APT_WAPT_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_APT_Bits.WAPT */
#define IFX_GTM_DPLL_APT_WAPT_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_APT_Bits.WAPT */
#define IFX_GTM_DPLL_APT_WAPT_OFF (1u)

/** \brief  Length for Ifx_GTM_DPLL_CDT_SX_Bits.CDT_SX */
#define IFX_GTM_DPLL_CDT_SX_CDT_SX_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_CDT_SX_Bits.CDT_SX */
#define IFX_GTM_DPLL_CDT_SX_CDT_SX_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_CDT_SX_Bits.CDT_SX */
#define IFX_GTM_DPLL_CDT_SX_CDT_SX_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_CDT_SX_NOM_Bits.CDT_SX_NOM */
#define IFX_GTM_DPLL_CDT_SX_NOM_CDT_SX_NOM_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_CDT_SX_NOM_Bits.CDT_SX_NOM */
#define IFX_GTM_DPLL_CDT_SX_NOM_CDT_SX_NOM_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_CDT_SX_NOM_Bits.CDT_SX_NOM */
#define IFX_GTM_DPLL_CDT_SX_NOM_CDT_SX_NOM_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_CDT_TX_Bits.CDT_TX */
#define IFX_GTM_DPLL_CDT_TX_CDT_TX_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_CDT_TX_Bits.CDT_TX */
#define IFX_GTM_DPLL_CDT_TX_CDT_TX_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_CDT_TX_Bits.CDT_TX */
#define IFX_GTM_DPLL_CDT_TX_CDT_TX_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_CDT_TX_NOM_Bits.CDT_TX_NOM */
#define IFX_GTM_DPLL_CDT_TX_NOM_CDT_TX_NOM_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_CDT_TX_NOM_Bits.CDT_TX_NOM */
#define IFX_GTM_DPLL_CDT_TX_NOM_CDT_TX_NOM_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_CDT_TX_NOM_Bits.CDT_TX_NOM */
#define IFX_GTM_DPLL_CDT_TX_NOM_CDT_TX_NOM_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_CNT_NUM1_Bits.CNT_NUM_1 */
#define IFX_GTM_DPLL_CNT_NUM1_CNT_NUM_1_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_CNT_NUM1_Bits.CNT_NUM_1 */
#define IFX_GTM_DPLL_CNT_NUM1_CNT_NUM_1_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_CNT_NUM1_Bits.CNT_NUM_1 */
#define IFX_GTM_DPLL_CNT_NUM1_CNT_NUM_1_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_CNT_NUM2_Bits.CNT_NUM_2 */
#define IFX_GTM_DPLL_CNT_NUM2_CNT_NUM_2_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_CNT_NUM2_Bits.CNT_NUM_2 */
#define IFX_GTM_DPLL_CNT_NUM2_CNT_NUM_2_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_CNT_NUM2_Bits.CNT_NUM_2 */
#define IFX_GTM_DPLL_CNT_NUM2_CNT_NUM_2_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.COA */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_COA_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.COA */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_COA_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.COA */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_COA_OFF (3u)

/** \brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DLM1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DLM1_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DLM1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DLM1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DLM1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DLM1_OFF (6u)

/** \brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DLM2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DLM2_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DLM2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DLM2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DLM2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DLM2_OFF (9u)

/** \brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DMO */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DMO_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DMO */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DMO_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DMO */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DMO_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PCM1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PCM1_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PCM1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PCM1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PCM1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PCM1_OFF (7u)

/** \brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PCM2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PCM2_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PCM2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PCM2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PCM2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PCM2_OFF (10u)

/** \brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PIT */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PIT_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PIT */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PIT_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PIT */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PIT_OFF (4u)

/** \brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SGE1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SGE1_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SGE1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SGE1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SGE1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SGE1_OFF (5u)

/** \brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SGE2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SGE2_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SGE2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SGE2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SGE2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SGE2_OFF (8u)

/** \brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SYN_NS */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SYN_NS_LEN (21u)

