luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_bf.h
/** \brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SYN_NS */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SYN_NS_MSK (0x1fffffu)

/** \brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SYN_NS */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SYN_NS_OFF (11u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_AMS_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_AMS_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_AMS_OFF (25u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_AMT_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_AMT_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_AMT_OFF (26u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_IDS_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_IDS_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_IDS_OFF (27u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_IDT_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_IDT_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_IDT_OFF (28u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_IFP_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_IFP_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_IFP_OFF (10u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_MLT_LEN (10u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_MLT_MSK (0x3ffu)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_MLT_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_RMO_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_RMO_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_RMO_OFF (31u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SEN_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SEN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SEN_OFF (29u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_AMS_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_AMS_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_AMS_OFF (25u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IDS_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IDS_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IDS_OFF (27u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IFP_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IFP_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IFP_OFF (10u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_RMO_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_RMO_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_RMO_OFF (31u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_AMT_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_AMT_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_AMT_OFF (26u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IDS_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IDS_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IDS_OFF (27u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IDT_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IDT_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IDT_OFF (28u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IFP_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IFP_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IFP_OFF (10u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_MLT_LEN (10u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_MLT_MSK (0x3ffu)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_MLT_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_RMO_LEN (1u)

