luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_bf.h
/** \brief  Mask for Ifx_GTM_DPLL_DT_S_Bits.DT_S */
#define IFX_GTM_DPLL_DT_S_DT_S_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_DT_S_Bits.DT_S */
#define IFX_GTM_DPLL_DT_S_DT_S_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_DT_T_ACT_Bits.DT_T_ACT */
#define IFX_GTM_DPLL_DT_T_ACT_DT_T_ACT_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_DT_T_ACT_Bits.DT_T_ACT */
#define IFX_GTM_DPLL_DT_T_ACT_DT_T_ACT_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_DT_T_ACT_Bits.DT_T_ACT */
#define IFX_GTM_DPLL_DT_T_ACT_DT_T_ACT_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_DTA_Bits.DTA */
#define IFX_GTM_DPLL_DTA_DTA_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_DTA_Bits.DTA */
#define IFX_GTM_DPLL_DTA_DTA_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_DTA_Bits.DTA */
#define IFX_GTM_DPLL_DTA_DTA_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_EDT_S_Bits.EDT_S */
#define IFX_GTM_DPLL_EDT_S_EDT_S_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_EDT_S_Bits.EDT_S */
#define IFX_GTM_DPLL_EDT_S_EDT_S_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_EDT_S_Bits.EDT_S */
#define IFX_GTM_DPLL_EDT_S_EDT_S_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_EDT_T_Bits.EDT_T */
#define IFX_GTM_DPLL_EDT_T_EDT_T_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_EDT_T_Bits.EDT_T */
#define IFX_GTM_DPLL_EDT_T_EDT_T_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_EDT_T_Bits.EDT_T */
#define IFX_GTM_DPLL_EDT_T_EDT_T_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.CDSI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_CDSI_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.CDSI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_CDSI_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.CDSI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_CDSI_EIRQ_EN_OFF (24u)

/** \brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.CDTI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_CDTI_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.CDTI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_CDTI_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.CDTI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_CDTI_EIRQ_EN_OFF (23u)

/** \brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.DCGI */
#define IFX_GTM_DPLL_EIRQ_EN_DCGI_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.DCGI */
#define IFX_GTM_DPLL_EIRQ_EN_DCGI_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.DCGI */
#define IFX_GTM_DPLL_EIRQ_EN_DCGI_OFF (27u)

/** \brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.EI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_EI_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.EI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_EI_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.EI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_EI_EIRQ_EN_OFF (15u)

/** \brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.GL1I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_GL1I_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.GL1I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_GL1I_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.GL1I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_GL1I_EIRQ_EN_OFF (13u)

/** \brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.GL2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_GL2I_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.GL2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_GL2I_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.GL2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_GL2I_EIRQ_EN_OFF (16u)

/** \brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.LL1I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_LL1I_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.LL1I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_LL1I_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.LL1I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_LL1I_EIRQ_EN_OFF (14u)

/** \brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.LL2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_LL2I_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.LL2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_LL2I_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.LL2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_LL2I_EIRQ_EN_OFF (17u)

/** \brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.MSI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_MSI_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.MSI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_MSI_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.MSI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_MSI_EIRQ_EN_OFF (6u)

/** \brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.MTI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_MTI_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.MTI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_MTI_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.MTI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_MTI_EIRQ_EN_OFF (7u)

/** \brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.PDI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_PDI_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.PDI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_PDI_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.PDI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_PDI_EIRQ_EN_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.PEI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_PEI_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.PEI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_PEI_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.PEI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_PEI_EIRQ_EN_OFF (1u)

/** \brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.PWI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_PWI_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.PWI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_PWI_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.PWI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_PWI_EIRQ_EN_OFF (10u)

/** \brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.SASI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_SASI_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.SASI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_SASI_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.SASI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_SASI_EIRQ_EN_OFF (8u)

