luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_bf.h
/** \brief  Mask for Ifx_GTM_DPLL_NMB_S_TAR_Bits.NMB_S_TAR */
#define IFX_GTM_DPLL_NMB_S_TAR_NMB_S_TAR_MSK (0xfffffu)

/** \brief  Offset for Ifx_GTM_DPLL_NMB_S_TAR_Bits.NMB_S_TAR */
#define IFX_GTM_DPLL_NMB_S_TAR_NMB_S_TAR_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_NMB_S_TAR_OLD_Bits.NMB_S_TAR_OLD */
#define IFX_GTM_DPLL_NMB_S_TAR_OLD_NMB_S_TAR_OLD_LEN (20u)

/** \brief  Mask for Ifx_GTM_DPLL_NMB_S_TAR_OLD_Bits.NMB_S_TAR_OLD */
#define IFX_GTM_DPLL_NMB_S_TAR_OLD_NMB_S_TAR_OLD_MSK (0xfffffu)

/** \brief  Offset for Ifx_GTM_DPLL_NMB_S_TAR_OLD_Bits.NMB_S_TAR_OLD */
#define IFX_GTM_DPLL_NMB_S_TAR_OLD_NMB_S_TAR_OLD_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_NMB_T_Bits.NMB_T */
#define IFX_GTM_DPLL_NMB_T_NMB_T_LEN (16u)

/** \brief  Mask for Ifx_GTM_DPLL_NMB_T_Bits.NMB_T */
#define IFX_GTM_DPLL_NMB_T_NMB_T_MSK (0xffffu)

/** \brief  Offset for Ifx_GTM_DPLL_NMB_T_Bits.NMB_T */
#define IFX_GTM_DPLL_NMB_T_NMB_T_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_NMB_T_TAR_Bits.NMB_T_TAR */
#define IFX_GTM_DPLL_NMB_T_TAR_NMB_T_TAR_LEN (16u)

/** \brief  Mask for Ifx_GTM_DPLL_NMB_T_TAR_Bits.NMB_T_TAR */
#define IFX_GTM_DPLL_NMB_T_TAR_NMB_T_TAR_MSK (0xffffu)

/** \brief  Offset for Ifx_GTM_DPLL_NMB_T_TAR_Bits.NMB_T_TAR */
#define IFX_GTM_DPLL_NMB_T_TAR_NMB_T_TAR_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits.NMB_T_TAR_OLD */
#define IFX_GTM_DPLL_NMB_T_TAR_OLD_NMB_T_TAR_OLD_LEN (16u)

/** \brief  Mask for Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits.NMB_T_TAR_OLD */
#define IFX_GTM_DPLL_NMB_T_TAR_OLD_NMB_T_TAR_OLD_MSK (0xffffu)

/** \brief  Offset for Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits.NMB_T_TAR_OLD */
#define IFX_GTM_DPLL_NMB_T_TAR_OLD_NMB_T_TAR_OLD_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_NTI_CNT_Bits.NTI_CNT */
#define IFX_GTM_DPLL_NTI_CNT_NTI_CNT_LEN (10u)

/** \brief  Mask for Ifx_GTM_DPLL_NTI_CNT_Bits.NTI_CNT */
#define IFX_GTM_DPLL_NTI_CNT_NTI_CNT_MSK (0x3ffu)

/** \brief  Offset for Ifx_GTM_DPLL_NTI_CNT_Bits.NTI_CNT */
#define IFX_GTM_DPLL_NTI_CNT_NTI_CNT_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_NUSC_Bits.FSS */
#define IFX_GTM_DPLL_NUSC_FSS_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.FSS */
#define IFX_GTM_DPLL_NUSC_FSS_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.FSS */
#define IFX_GTM_DPLL_NUSC_FSS_OFF (6u)

/** \brief  Length for Ifx_GTM_DPLL_NUSC_Bits.NUSE */
#define IFX_GTM_DPLL_NUSC_NUSE_LEN (6u)

/** \brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.NUSE */
#define IFX_GTM_DPLL_NUSC_NUSE_MSK (0x3fu)

/** \brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.NUSE */
#define IFX_GTM_DPLL_NUSC_NUSE_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_NUSC_Bits.SYN_S */
#define IFX_GTM_DPLL_NUSC_SYN_S_LEN (6u)

/** \brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.SYN_S */
#define IFX_GTM_DPLL_NUSC_SYN_S_MSK (0x3fu)

/** \brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.SYN_S */
#define IFX_GTM_DPLL_NUSC_SYN_S_OFF (7u)

/** \brief  Length for Ifx_GTM_DPLL_NUSC_Bits.SYN_S_OLD */
#define IFX_GTM_DPLL_NUSC_SYN_S_OLD_LEN (6u)

/** \brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.SYN_S_OLD */
#define IFX_GTM_DPLL_NUSC_SYN_S_OLD_MSK (0x3fu)

/** \brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.SYN_S_OLD */
#define IFX_GTM_DPLL_NUSC_SYN_S_OLD_OFF (13u)

/** \brief  Length for Ifx_GTM_DPLL_NUSC_Bits.VSN */
#define IFX_GTM_DPLL_NUSC_VSN_LEN (6u)

/** \brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.VSN */
#define IFX_GTM_DPLL_NUSC_VSN_MSK (0x3fu)

/** \brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.VSN */
#define IFX_GTM_DPLL_NUSC_VSN_OFF (19u)

/** \brief  Length for Ifx_GTM_DPLL_NUSC_Bits.WNUS */
#define IFX_GTM_DPLL_NUSC_WNUS_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.WNUS */
#define IFX_GTM_DPLL_NUSC_WNUS_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.WNUS */
#define IFX_GTM_DPLL_NUSC_WNUS_OFF (29u)

/** \brief  Length for Ifx_GTM_DPLL_NUSC_Bits.WSYN */
#define IFX_GTM_DPLL_NUSC_WSYN_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.WSYN */
#define IFX_GTM_DPLL_NUSC_WSYN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.WSYN */
#define IFX_GTM_DPLL_NUSC_WSYN_OFF (30u)

/** \brief  Length for Ifx_GTM_DPLL_NUSC_Bits.WVSN */
#define IFX_GTM_DPLL_NUSC_WVSN_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.WVSN */
#define IFX_GTM_DPLL_NUSC_WVSN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.WVSN */
#define IFX_GTM_DPLL_NUSC_WVSN_OFF (31u)

/** \brief  Length for Ifx_GTM_DPLL_NUTC_Bits.FST */
#define IFX_GTM_DPLL_NUTC_FST_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_NUTC_Bits.FST */
#define IFX_GTM_DPLL_NUTC_FST_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_NUTC_Bits.FST */
#define IFX_GTM_DPLL_NUTC_FST_OFF (10u)

/** \brief  Length for Ifx_GTM_DPLL_NUTC_Bits.NUTE */
#define IFX_GTM_DPLL_NUTC_NUTE_LEN (10u)

/** \brief  Mask for Ifx_GTM_DPLL_NUTC_Bits.NUTE */
#define IFX_GTM_DPLL_NUTC_NUTE_MSK (0x3ffu)

/** \brief  Offset for Ifx_GTM_DPLL_NUTC_Bits.NUTE */
#define IFX_GTM_DPLL_NUTC_NUTE_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_NUTC_Bits.SYN_T */
#define IFX_GTM_DPLL_NUTC_SYN_T_LEN (3u)

/** \brief  Mask for Ifx_GTM_DPLL_NUTC_Bits.SYN_T */
#define IFX_GTM_DPLL_NUTC_SYN_T_MSK (0x7u)

/** \brief  Offset for Ifx_GTM_DPLL_NUTC_Bits.SYN_T */
#define IFX_GTM_DPLL_NUTC_SYN_T_OFF (13u)

/** \brief  Length for Ifx_GTM_DPLL_NUTC_Bits.SYN_T_OLD */
#define IFX_GTM_DPLL_NUTC_SYN_T_OLD_LEN (3u)

/** \brief  Mask for Ifx_GTM_DPLL_NUTC_Bits.SYN_T_OLD */
#define IFX_GTM_DPLL_NUTC_SYN_T_OLD_MSK (0x7u)

/** \brief  Offset for Ifx_GTM_DPLL_NUTC_Bits.SYN_T_OLD */
#define IFX_GTM_DPLL_NUTC_SYN_T_OLD_OFF (16u)

/** \brief  Length for Ifx_GTM_DPLL_NUTC_Bits.VTN */
#define IFX_GTM_DPLL_NUTC_VTN_LEN (6u)

/** \brief  Mask for Ifx_GTM_DPLL_NUTC_Bits.VTN */
#define IFX_GTM_DPLL_NUTC_VTN_MSK (0x3fu)

/** \brief  Offset for Ifx_GTM_DPLL_NUTC_Bits.VTN */
#define IFX_GTM_DPLL_NUTC_VTN_OFF (19u)

/** \brief  Length for Ifx_GTM_DPLL_NUTC_Bits.WNUT */
#define IFX_GTM_DPLL_NUTC_WNUT_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_NUTC_Bits.WNUT */
#define IFX_GTM_DPLL_NUTC_WNUT_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_NUTC_Bits.WNUT */
#define IFX_GTM_DPLL_NUTC_WNUT_OFF (29u)

/** \brief  Length for Ifx_GTM_DPLL_NUTC_Bits.WSYN */
#define IFX_GTM_DPLL_NUTC_WSYN_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_NUTC_Bits.WSYN */
#define IFX_GTM_DPLL_NUTC_WSYN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_NUTC_Bits.WSYN */
#define IFX_GTM_DPLL_NUTC_WSYN_OFF (30u)

/** \brief  Length for Ifx_GTM_DPLL_NUTC_Bits.WVTN */
#define IFX_GTM_DPLL_NUTC_WVTN_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_NUTC_Bits.WVTN */
#define IFX_GTM_DPLL_NUTC_WVTN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_NUTC_Bits.WVTN */
#define IFX_GTM_DPLL_NUTC_WVTN_OFF (31u)

/** \brief  Length for Ifx_GTM_DPLL_OSW_Bits.OSS */
#define IFX_GTM_DPLL_OSW_OSS_LEN (2u)

/** \brief  Mask for Ifx_GTM_DPLL_OSW_Bits.OSS */
#define IFX_GTM_DPLL_OSW_OSS_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_DPLL_OSW_Bits.OSS */
#define IFX_GTM_DPLL_OSW_OSS_OFF (8u)

/** \brief  Length for Ifx_GTM_DPLL_OSW_Bits.SWON_S */
#define IFX_GTM_DPLL_OSW_SWON_S_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_OSW_Bits.SWON_S */
#define IFX_GTM_DPLL_OSW_SWON_S_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_OSW_Bits.SWON_S */
#define IFX_GTM_DPLL_OSW_SWON_S_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_OSW_Bits.SWON_T */
#define IFX_GTM_DPLL_OSW_SWON_T_LEN (1u)

