luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_bf.h
/** \brief  Offset for Ifx_GTM_DPLL_TS_T_1_Bits.TRIGGER_TS */
#define IFX_GTM_DPLL_TS_T_1_TRIGGER_TS_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_TSAC_Bits.TSAC */
#define IFX_GTM_DPLL_TSAC_TSAC_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_TSAC_Bits.TSAC */
#define IFX_GTM_DPLL_TSAC_TSAC_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_TSAC_Bits.TSAC */
#define IFX_GTM_DPLL_TSAC_TSAC_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_TSF_S_Bits.TSF_S */
#define IFX_GTM_DPLL_TSF_S_TSF_S_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_TSF_S_Bits.TSF_S */
#define IFX_GTM_DPLL_TSF_S_TSF_S_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_TSF_S_Bits.TSF_S */
#define IFX_GTM_DPLL_TSF_S_TSF_S_OFF (0u)

/** \brief  Length for Ifx_GTM_DXINCON_Bits.DSS00 */
#define IFX_GTM_DXINCON_DSS00_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXINCON_Bits.DSS00 */
#define IFX_GTM_DXINCON_DSS00_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXINCON_Bits.DSS00 */
#define IFX_GTM_DXINCON_DSS00_OFF (16u)

/** \brief  Length for Ifx_GTM_DXINCON_Bits.DSS01 */
#define IFX_GTM_DXINCON_DSS01_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXINCON_Bits.DSS01 */
#define IFX_GTM_DXINCON_DSS01_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXINCON_Bits.DSS01 */
#define IFX_GTM_DXINCON_DSS01_OFF (17u)

/** \brief  Length for Ifx_GTM_DXINCON_Bits.DSS02 */
#define IFX_GTM_DXINCON_DSS02_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXINCON_Bits.DSS02 */
#define IFX_GTM_DXINCON_DSS02_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXINCON_Bits.DSS02 */
#define IFX_GTM_DXINCON_DSS02_OFF (18u)

/** \brief  Length for Ifx_GTM_DXINCON_Bits.DSS03 */
#define IFX_GTM_DXINCON_DSS03_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXINCON_Bits.DSS03 */
#define IFX_GTM_DXINCON_DSS03_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXINCON_Bits.DSS03 */
#define IFX_GTM_DXINCON_DSS03_OFF (19u)

/** \brief  Length for Ifx_GTM_DXINCON_Bits.DSS10 */
#define IFX_GTM_DXINCON_DSS10_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXINCON_Bits.DSS10 */
#define IFX_GTM_DXINCON_DSS10_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXINCON_Bits.DSS10 */
#define IFX_GTM_DXINCON_DSS10_OFF (24u)

/** \brief  Length for Ifx_GTM_DXINCON_Bits.DSS11 */
#define IFX_GTM_DXINCON_DSS11_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXINCON_Bits.DSS11 */
#define IFX_GTM_DXINCON_DSS11_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXINCON_Bits.DSS11 */
#define IFX_GTM_DXINCON_DSS11_OFF (25u)

/** \brief  Length for Ifx_GTM_DXINCON_Bits.DSS12 */
#define IFX_GTM_DXINCON_DSS12_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXINCON_Bits.DSS12 */
#define IFX_GTM_DXINCON_DSS12_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXINCON_Bits.DSS12 */
#define IFX_GTM_DXINCON_DSS12_OFF (26u)

/** \brief  Length for Ifx_GTM_DXINCON_Bits.DSS13 */
#define IFX_GTM_DXINCON_DSS13_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXINCON_Bits.DSS13 */
#define IFX_GTM_DXINCON_DSS13_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXINCON_Bits.DSS13 */
#define IFX_GTM_DXINCON_DSS13_OFF (27u)

/** \brief  Length for Ifx_GTM_DXINCON_Bits.IN00 */
#define IFX_GTM_DXINCON_IN00_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXINCON_Bits.IN00 */
#define IFX_GTM_DXINCON_IN00_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXINCON_Bits.IN00 */
#define IFX_GTM_DXINCON_IN00_OFF (0u)

/** \brief  Length for Ifx_GTM_DXINCON_Bits.IN01 */
#define IFX_GTM_DXINCON_IN01_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXINCON_Bits.IN01 */
#define IFX_GTM_DXINCON_IN01_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXINCON_Bits.IN01 */
#define IFX_GTM_DXINCON_IN01_OFF (1u)

/** \brief  Length for Ifx_GTM_DXINCON_Bits.IN02 */
#define IFX_GTM_DXINCON_IN02_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXINCON_Bits.IN02 */
#define IFX_GTM_DXINCON_IN02_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXINCON_Bits.IN02 */
#define IFX_GTM_DXINCON_IN02_OFF (2u)

/** \brief  Length for Ifx_GTM_DXINCON_Bits.IN03 */
#define IFX_GTM_DXINCON_IN03_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXINCON_Bits.IN03 */
#define IFX_GTM_DXINCON_IN03_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXINCON_Bits.IN03 */
#define IFX_GTM_DXINCON_IN03_OFF (3u)

/** \brief  Length for Ifx_GTM_DXINCON_Bits.IN10 */
#define IFX_GTM_DXINCON_IN10_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXINCON_Bits.IN10 */
#define IFX_GTM_DXINCON_IN10_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXINCON_Bits.IN10 */
#define IFX_GTM_DXINCON_IN10_OFF (8u)

/** \brief  Length for Ifx_GTM_DXINCON_Bits.IN11 */
#define IFX_GTM_DXINCON_IN11_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXINCON_Bits.IN11 */
#define IFX_GTM_DXINCON_IN11_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXINCON_Bits.IN11 */
#define IFX_GTM_DXINCON_IN11_OFF (9u)

/** \brief  Length for Ifx_GTM_DXINCON_Bits.IN12 */
#define IFX_GTM_DXINCON_IN12_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXINCON_Bits.IN12 */
#define IFX_GTM_DXINCON_IN12_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXINCON_Bits.IN12 */
#define IFX_GTM_DXINCON_IN12_OFF (10u)

/** \brief  Length for Ifx_GTM_DXINCON_Bits.IN13 */
#define IFX_GTM_DXINCON_IN13_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXINCON_Bits.IN13 */
#define IFX_GTM_DXINCON_IN13_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXINCON_Bits.IN13 */
#define IFX_GTM_DXINCON_IN13_OFF (11u)

/** \brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT00 */
#define IFX_GTM_DXOUTCON_OUT00_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT00 */
#define IFX_GTM_DXOUTCON_OUT00_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT00 */
#define IFX_GTM_DXOUTCON_OUT00_OFF (0u)

/** \brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT01 */
#define IFX_GTM_DXOUTCON_OUT01_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT01 */
#define IFX_GTM_DXOUTCON_OUT01_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT01 */
#define IFX_GTM_DXOUTCON_OUT01_OFF (1u)

/** \brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT02 */
#define IFX_GTM_DXOUTCON_OUT02_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT02 */
#define IFX_GTM_DXOUTCON_OUT02_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT02 */
#define IFX_GTM_DXOUTCON_OUT02_OFF (2u)

/** \brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT03 */
#define IFX_GTM_DXOUTCON_OUT03_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT03 */
#define IFX_GTM_DXOUTCON_OUT03_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT03 */
#define IFX_GTM_DXOUTCON_OUT03_OFF (3u)

/** \brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT10 */
#define IFX_GTM_DXOUTCON_OUT10_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT10 */
#define IFX_GTM_DXOUTCON_OUT10_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT10 */
#define IFX_GTM_DXOUTCON_OUT10_OFF (8u)

