luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_bf.h
/** \brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT11 */
#define IFX_GTM_DXOUTCON_OUT11_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT11 */
#define IFX_GTM_DXOUTCON_OUT11_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT11 */
#define IFX_GTM_DXOUTCON_OUT11_OFF (9u)

/** \brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT12 */
#define IFX_GTM_DXOUTCON_OUT12_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT12 */
#define IFX_GTM_DXOUTCON_OUT12_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT12 */
#define IFX_GTM_DXOUTCON_OUT12_OFF (10u)

/** \brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT13 */
#define IFX_GTM_DXOUTCON_OUT13_LEN (1u)

/** \brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT13 */
#define IFX_GTM_DXOUTCON_OUT13_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT13 */
#define IFX_GTM_DXOUTCON_OUT13_OFF (11u)

/** \brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEI_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_IM_ADDR_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_IM_ADDR_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_IM_ADDR_EIRQ_EN_OFF (2u)

/** \brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEI_TO_XPT_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_TO_XPT_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_TO_XPT_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_TO_XPT_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_TO_XPT_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_TO_XPT_EIRQ_EN_OFF (0u)

/** \brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_OFF (1u)

/** \brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_OFF (3u)

/** \brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR0_EN */
#define IFX_GTM_F2A_ENABLE_STR0_EN_LEN (2u)

/** \brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR0_EN */
#define IFX_GTM_F2A_ENABLE_STR0_EN_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR0_EN */
#define IFX_GTM_F2A_ENABLE_STR0_EN_OFF (0u)

/** \brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR1_EN */
#define IFX_GTM_F2A_ENABLE_STR1_EN_LEN (2u)

/** \brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR1_EN */
#define IFX_GTM_F2A_ENABLE_STR1_EN_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR1_EN */
#define IFX_GTM_F2A_ENABLE_STR1_EN_OFF (2u)

/** \brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR2_EN */
#define IFX_GTM_F2A_ENABLE_STR2_EN_LEN (2u)

/** \brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR2_EN */
#define IFX_GTM_F2A_ENABLE_STR2_EN_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR2_EN */
#define IFX_GTM_F2A_ENABLE_STR2_EN_OFF (4u)

/** \brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR3_EN */
#define IFX_GTM_F2A_ENABLE_STR3_EN_LEN (2u)

/** \brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR3_EN */
#define IFX_GTM_F2A_ENABLE_STR3_EN_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR3_EN */
#define IFX_GTM_F2A_ENABLE_STR3_EN_OFF (6u)

/** \brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR4_EN */
#define IFX_GTM_F2A_ENABLE_STR4_EN_LEN (2u)

/** \brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR4_EN */
#define IFX_GTM_F2A_ENABLE_STR4_EN_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR4_EN */
#define IFX_GTM_F2A_ENABLE_STR4_EN_OFF (8u)

/** \brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR5_EN */
#define IFX_GTM_F2A_ENABLE_STR5_EN_LEN (2u)

/** \brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR5_EN */
#define IFX_GTM_F2A_ENABLE_STR5_EN_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR5_EN */
#define IFX_GTM_F2A_ENABLE_STR5_EN_OFF (10u)

/** \brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR6_EN */
#define IFX_GTM_F2A_ENABLE_STR6_EN_LEN (2u)

/** \brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR6_EN */
#define IFX_GTM_F2A_ENABLE_STR6_EN_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR6_EN */
#define IFX_GTM_F2A_ENABLE_STR6_EN_OFF (12u)

/** \brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR7_EN */
#define IFX_GTM_F2A_ENABLE_STR7_EN_LEN (2u)

/** \brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR7_EN */
#define IFX_GTM_F2A_ENABLE_STR7_EN_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR7_EN */
#define IFX_GTM_F2A_ENABLE_STR7_EN_OFF (14u)

/** \brief  Length for Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO_Bits.ADDR */
#define IFX_GTM_F2A_RD_CH_ARU_RD_FIFO_ADDR_LEN (9u)

/** \brief  Mask for Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO_Bits.ADDR */
#define IFX_GTM_F2A_RD_CH_ARU_RD_FIFO_ADDR_MSK (0x1ffu)

/** \brief  Offset for Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO_Bits.ADDR */
#define IFX_GTM_F2A_RD_CH_ARU_RD_FIFO_ADDR_OFF (0u)

/** \brief  Length for Ifx_GTM_F2A_STR_CH_STR_CFG_Bits.DIR */
#define IFX_GTM_F2A_STR_CH_STR_CFG_DIR_LEN (1u)

/** \brief  Mask for Ifx_GTM_F2A_STR_CH_STR_CFG_Bits.DIR */
#define IFX_GTM_F2A_STR_CH_STR_CFG_DIR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_F2A_STR_CH_STR_CFG_Bits.DIR */
#define IFX_GTM_F2A_STR_CH_STR_CFG_DIR_OFF (18u)

/** \brief  Length for Ifx_GTM_F2A_STR_CH_STR_CFG_Bits.TMODE */
#define IFX_GTM_F2A_STR_CH_STR_CFG_TMODE_LEN (2u)

/** \brief  Mask for Ifx_GTM_F2A_STR_CH_STR_CFG_Bits.TMODE */
#define IFX_GTM_F2A_STR_CH_STR_CFG_TMODE_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_F2A_STR_CH_STR_CFG_Bits.TMODE */
#define IFX_GTM_F2A_STR_CH_STR_CFG_TMODE_OFF (16u)

/** \brief  Length for Ifx_GTM_FIFO_CH_CTRL_Bits.FLUSH */
#define IFX_GTM_FIFO_CH_CTRL_FLUSH_LEN (1u)

/** \brief  Mask for Ifx_GTM_FIFO_CH_CTRL_Bits.FLUSH */
#define IFX_GTM_FIFO_CH_CTRL_FLUSH_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_FIFO_CH_CTRL_Bits.FLUSH */
#define IFX_GTM_FIFO_CH_CTRL_FLUSH_OFF (2u)

/** \brief  Length for Ifx_GTM_FIFO_CH_CTRL_Bits.RAP */
#define IFX_GTM_FIFO_CH_CTRL_RAP_LEN (1u)

/** \brief  Mask for Ifx_GTM_FIFO_CH_CTRL_Bits.RAP */
#define IFX_GTM_FIFO_CH_CTRL_RAP_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_FIFO_CH_CTRL_Bits.RAP */
#define IFX_GTM_FIFO_CH_CTRL_RAP_OFF (1u)

