luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_bf.h
/** \brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH15_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH15_IRQ_OFF (15u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH1_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH1_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH1_IRQ_OFF (1u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH2_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH2_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH2_IRQ_OFF (2u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH3_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH3_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH3_IRQ_OFF (3u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH4_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH4_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH4_IRQ_OFF (4u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH5_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH5_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH5_IRQ_OFF (5u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH6_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH6_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH6_IRQ_OFF (6u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH7_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH7_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH7_IRQ_OFF (7u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH8_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH8_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH8_IRQ_OFF (8u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH9_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH9_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH9_IRQ_OFF (9u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH0_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH0_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH0_IRQ_OFF (0u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH1_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH1_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH1_IRQ_OFF (1u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH2_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH2_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH2_IRQ_OFF (2u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH3_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH3_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH3_IRQ_OFF (3u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH4_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH4_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH4_IRQ_OFF (4u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH5_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH5_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH5_IRQ_OFF (5u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH6_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH6_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH6_IRQ_OFF (6u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH7_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH7_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH7_IRQ_OFF (7u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH0_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH0_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH0_IRQ_OFF (8u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH1_IRQ_LEN (1u)

