luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_bf.h
/** \brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL7 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL7_OFF (28u)

/** \brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL0_LEN (3u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL0_MSK (0x7u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL0_OFF (0u)

/** \brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL1_LEN (3u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL1_MSK (0x7u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL1_OFF (4u)

/** \brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL2_LEN (3u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL2_MSK (0x7u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL2_OFF (8u)

/** \brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL3_LEN (3u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL3_MSK (0x7u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL3_OFF (12u)

/** \brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL4_LEN (3u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL4_MSK (0x7u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL4_OFF (16u)

/** \brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL5_LEN (3u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL5_MSK (0x7u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL5_OFF (20u)

/** \brief  Length for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL0_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL0_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL0_OFF (0u)

/** \brief  Length for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL1_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL1_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL1_OFF (4u)

/** \brief  Length for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL2_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL2_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL2_OFF (8u)

/** \brief  Length for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL3_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL3_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL3_OFF (12u)

/** \brief  Length for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL4_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL4_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL4_OFF (16u)

/** \brief  Length for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL5_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL5_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL5_OFF (20u)

/** \brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL0_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL0_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL0_OFF (0u)

/** \brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL1_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL1_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL1_OFF (4u)

/** \brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL2_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL2_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL2_OFF (8u)

/** \brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL3_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL3_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL3_OFF (12u)

/** \brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL4_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL4_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL4_OFF (16u)

/** \brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL5_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL5_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL5_OFF (20u)

/** \brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL6_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL6_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL6_OFF (24u)

/** \brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL7_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL7_MSK (0xfu)

