luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_bf.h
/** \brief  Length for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_STK_ERR_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_STK_ERR_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_STK_ERR_IRQ_OFF (1u)

/** \brief  Length for Ifx_GTM_MCS_CH_PC_Bits.PC */
#define IFX_GTM_MCS_CH_PC_PC_LEN (14u)

/** \brief  Mask for Ifx_GTM_MCS_CH_PC_Bits.PC */
#define IFX_GTM_MCS_CH_PC_PC_MSK (0x3fffu)

/** \brief  Offset for Ifx_GTM_MCS_CH_PC_Bits.PC */
#define IFX_GTM_MCS_CH_PC_PC_OFF (0u)

/** \brief  Length for Ifx_GTM_MCS_CH_R0_Bits.DATA */
#define IFX_GTM_MCS_CH_R0_DATA_LEN (24u)

/** \brief  Mask for Ifx_GTM_MCS_CH_R0_Bits.DATA */
#define IFX_GTM_MCS_CH_R0_DATA_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_MCS_CH_R0_Bits.DATA */
#define IFX_GTM_MCS_CH_R0_DATA_OFF (0u)

/** \brief  Length for Ifx_GTM_MCS_CH_R1_Bits.DATA */
#define IFX_GTM_MCS_CH_R1_DATA_LEN (24u)

/** \brief  Mask for Ifx_GTM_MCS_CH_R1_Bits.DATA */
#define IFX_GTM_MCS_CH_R1_DATA_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_MCS_CH_R1_Bits.DATA */
#define IFX_GTM_MCS_CH_R1_DATA_OFF (0u)

/** \brief  Length for Ifx_GTM_MCS_CH_R2_Bits.DATA */
#define IFX_GTM_MCS_CH_R2_DATA_LEN (24u)

/** \brief  Mask for Ifx_GTM_MCS_CH_R2_Bits.DATA */
#define IFX_GTM_MCS_CH_R2_DATA_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_MCS_CH_R2_Bits.DATA */
#define IFX_GTM_MCS_CH_R2_DATA_OFF (0u)

/** \brief  Length for Ifx_GTM_MCS_CH_R3_Bits.DATA */
#define IFX_GTM_MCS_CH_R3_DATA_LEN (24u)

/** \brief  Mask for Ifx_GTM_MCS_CH_R3_Bits.DATA */
#define IFX_GTM_MCS_CH_R3_DATA_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_MCS_CH_R3_Bits.DATA */
#define IFX_GTM_MCS_CH_R3_DATA_OFF (0u)

/** \brief  Length for Ifx_GTM_MCS_CH_R4_Bits.DATA */
#define IFX_GTM_MCS_CH_R4_DATA_LEN (24u)

/** \brief  Mask for Ifx_GTM_MCS_CH_R4_Bits.DATA */
#define IFX_GTM_MCS_CH_R4_DATA_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_MCS_CH_R4_Bits.DATA */
#define IFX_GTM_MCS_CH_R4_DATA_OFF (0u)

/** \brief  Length for Ifx_GTM_MCS_CH_R5_Bits.DATA */
#define IFX_GTM_MCS_CH_R5_DATA_LEN (24u)

/** \brief  Mask for Ifx_GTM_MCS_CH_R5_Bits.DATA */
#define IFX_GTM_MCS_CH_R5_DATA_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_MCS_CH_R5_Bits.DATA */
#define IFX_GTM_MCS_CH_R5_DATA_OFF (0u)

/** \brief  Length for Ifx_GTM_MCS_CH_R6_Bits.DATA */
#define IFX_GTM_MCS_CH_R6_DATA_LEN (24u)

/** \brief  Mask for Ifx_GTM_MCS_CH_R6_Bits.DATA */
#define IFX_GTM_MCS_CH_R6_DATA_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_MCS_CH_R6_Bits.DATA */
#define IFX_GTM_MCS_CH_R6_DATA_OFF (0u)

/** \brief  Length for Ifx_GTM_MCS_CH_R7_Bits.DATA */
#define IFX_GTM_MCS_CH_R7_DATA_LEN (24u)

/** \brief  Mask for Ifx_GTM_MCS_CH_R7_Bits.DATA */
#define IFX_GTM_MCS_CH_R7_DATA_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_MCS_CH_R7_Bits.DATA */
#define IFX_GTM_MCS_CH_R7_DATA_OFF (0u)

/** \brief  Length for Ifx_GTM_MCS_CTRL_Bits.HLT_SP_OFL */
#define IFX_GTM_MCS_CTRL_HLT_SP_OFL_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_CTRL_Bits.HLT_SP_OFL */
#define IFX_GTM_MCS_CTRL_HLT_SP_OFL_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_CTRL_Bits.HLT_SP_OFL */
#define IFX_GTM_MCS_CTRL_HLT_SP_OFL_OFF (1u)

/** \brief  Length for Ifx_GTM_MCS_CTRL_Bits.RAM_RST */
#define IFX_GTM_MCS_CTRL_RAM_RST_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_CTRL_Bits.RAM_RST */
#define IFX_GTM_MCS_CTRL_RAM_RST_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_CTRL_Bits.RAM_RST */
#define IFX_GTM_MCS_CTRL_RAM_RST_OFF (16u)

/** \brief  Length for Ifx_GTM_MCS_CTRL_Bits.SCHED */
#define IFX_GTM_MCS_CTRL_SCHED_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_CTRL_Bits.SCHED */
#define IFX_GTM_MCS_CTRL_SCHED_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_CTRL_Bits.SCHED */
#define IFX_GTM_MCS_CTRL_SCHED_OFF (0u)

/** \brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR0 */
#define IFX_GTM_MCS_ERR_ERR0_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR0 */
#define IFX_GTM_MCS_ERR_ERR0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR0 */
#define IFX_GTM_MCS_ERR_ERR0_OFF (0u)

/** \brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR1 */
#define IFX_GTM_MCS_ERR_ERR1_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR1 */
#define IFX_GTM_MCS_ERR_ERR1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR1 */
#define IFX_GTM_MCS_ERR_ERR1_OFF (1u)

/** \brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR2 */
#define IFX_GTM_MCS_ERR_ERR2_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR2 */
#define IFX_GTM_MCS_ERR_ERR2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR2 */
#define IFX_GTM_MCS_ERR_ERR2_OFF (2u)

/** \brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR3 */
#define IFX_GTM_MCS_ERR_ERR3_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR3 */
#define IFX_GTM_MCS_ERR_ERR3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR3 */
#define IFX_GTM_MCS_ERR_ERR3_OFF (3u)

/** \brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR4 */
#define IFX_GTM_MCS_ERR_ERR4_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR4 */
#define IFX_GTM_MCS_ERR_ERR4_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR4 */
#define IFX_GTM_MCS_ERR_ERR4_OFF (4u)

/** \brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR5 */
#define IFX_GTM_MCS_ERR_ERR5_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR5 */
#define IFX_GTM_MCS_ERR_ERR5_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR5 */
#define IFX_GTM_MCS_ERR_ERR5_OFF (5u)

/** \brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR6 */
#define IFX_GTM_MCS_ERR_ERR6_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR6 */
#define IFX_GTM_MCS_ERR_ERR6_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR6 */
#define IFX_GTM_MCS_ERR_ERR6_OFF (6u)

/** \brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR7 */
#define IFX_GTM_MCS_ERR_ERR7_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR7 */
#define IFX_GTM_MCS_ERR_ERR7_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR7 */
#define IFX_GTM_MCS_ERR_ERR7_OFF (7u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.CAT0 */
#define IFX_GTM_MCS_RST_CAT0_LEN (1u)

