luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_bf.h
/** \brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_0_LEN (1u)

/** \brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_0_OFF (16u)

/** \brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_1_LEN (1u)

/** \brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_1_OFF (17u)

/** \brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_2_LEN (1u)

/** \brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_2_OFF (18u)

/** \brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_3_LEN (1u)

/** \brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_3_OFF (19u)

/** \brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_4_LEN (1u)

/** \brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_4_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_4_OFF (20u)

/** \brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_5_LEN (1u)

/** \brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_5_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_5_OFF (21u)

/** \brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_6_LEN (1u)

/** \brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_6_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_6_OFF (22u)

/** \brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_7_LEN (1u)

/** \brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_7_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_7_OFF (23u)

/** \brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_0_LEN (1u)

/** \brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_0_OFF (24u)

/** \brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_1_LEN (1u)

/** \brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_1_OFF (25u)

/** \brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_2_LEN (1u)

/** \brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_2_OFF (26u)

/** \brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_3_LEN (1u)

/** \brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_3_OFF (27u)

/** \brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_4_LEN (1u)

/** \brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_4_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_4_OFF (28u)

/** \brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_5_LEN (1u)

/** \brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_5_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_5_OFF (29u)

/** \brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_6_LEN (1u)

/** \brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_6_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_6_OFF (30u)

/** \brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_7_LEN (1u)

/** \brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_7_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_7_OFF (31u)

/** \brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU0 */
#define IFX_GTM_MON_STATUS_ACT_CMU0_LEN (1u)

/** \brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMU0 */
#define IFX_GTM_MON_STATUS_ACT_CMU0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU0 */
#define IFX_GTM_MON_STATUS_ACT_CMU0_OFF (0u)

/** \brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU1 */
#define IFX_GTM_MON_STATUS_ACT_CMU1_LEN (1u)

/** \brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMU1 */
#define IFX_GTM_MON_STATUS_ACT_CMU1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU1 */
#define IFX_GTM_MON_STATUS_ACT_CMU1_OFF (1u)

/** \brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU2 */
#define IFX_GTM_MON_STATUS_ACT_CMU2_LEN (1u)

