luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_bf.h
/** \brief  Offset for Ifx_GTM_MSCIN_INLCON_Bits.SEL3 */
#define IFX_GTM_MSCIN_INLCON_SEL3_OFF (6u)

/** \brief  Length for Ifx_GTM_MSCIN_INLCON_Bits.SEL4 */
#define IFX_GTM_MSCIN_INLCON_SEL4_LEN (2u)

/** \brief  Mask for Ifx_GTM_MSCIN_INLCON_Bits.SEL4 */
#define IFX_GTM_MSCIN_INLCON_SEL4_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_MSCIN_INLCON_Bits.SEL4 */
#define IFX_GTM_MSCIN_INLCON_SEL4_OFF (8u)

/** \brief  Length for Ifx_GTM_MSCIN_INLCON_Bits.SEL5 */
#define IFX_GTM_MSCIN_INLCON_SEL5_LEN (2u)

/** \brief  Mask for Ifx_GTM_MSCIN_INLCON_Bits.SEL5 */
#define IFX_GTM_MSCIN_INLCON_SEL5_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_MSCIN_INLCON_Bits.SEL5 */
#define IFX_GTM_MSCIN_INLCON_SEL5_OFF (10u)

/** \brief  Length for Ifx_GTM_MSCIN_INLCON_Bits.SEL6 */
#define IFX_GTM_MSCIN_INLCON_SEL6_LEN (2u)

/** \brief  Mask for Ifx_GTM_MSCIN_INLCON_Bits.SEL6 */
#define IFX_GTM_MSCIN_INLCON_SEL6_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_MSCIN_INLCON_Bits.SEL6 */
#define IFX_GTM_MSCIN_INLCON_SEL6_OFF (12u)

/** \brief  Length for Ifx_GTM_MSCIN_INLCON_Bits.SEL7 */
#define IFX_GTM_MSCIN_INLCON_SEL7_LEN (2u)

/** \brief  Mask for Ifx_GTM_MSCIN_INLCON_Bits.SEL7 */
#define IFX_GTM_MSCIN_INLCON_SEL7_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_MSCIN_INLCON_Bits.SEL7 */
#define IFX_GTM_MSCIN_INLCON_SEL7_OFF (14u)

/** \brief  Length for Ifx_GTM_MSCIN_INLCON_Bits.SEL8 */
#define IFX_GTM_MSCIN_INLCON_SEL8_LEN (2u)

/** \brief  Mask for Ifx_GTM_MSCIN_INLCON_Bits.SEL8 */
#define IFX_GTM_MSCIN_INLCON_SEL8_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_MSCIN_INLCON_Bits.SEL8 */
#define IFX_GTM_MSCIN_INLCON_SEL8_OFF (16u)

/** \brief  Length for Ifx_GTM_MSCIN_INLCON_Bits.SEL9 */
#define IFX_GTM_MSCIN_INLCON_SEL9_LEN (2u)

/** \brief  Mask for Ifx_GTM_MSCIN_INLCON_Bits.SEL9 */
#define IFX_GTM_MSCIN_INLCON_SEL9_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_MSCIN_INLCON_Bits.SEL9 */
#define IFX_GTM_MSCIN_INLCON_SEL9_OFF (18u)

/** \brief  Length for Ifx_GTM_MSCSET_CON0_Bits.SEL0 */
#define IFX_GTM_MSCSET_CON0_SEL0_LEN (5u)

/** \brief  Mask for Ifx_GTM_MSCSET_CON0_Bits.SEL0 */
#define IFX_GTM_MSCSET_CON0_SEL0_MSK (0x1fu)

/** \brief  Offset for Ifx_GTM_MSCSET_CON0_Bits.SEL0 */
#define IFX_GTM_MSCSET_CON0_SEL0_OFF (0u)

/** \brief  Length for Ifx_GTM_MSCSET_CON0_Bits.SEL1 */
#define IFX_GTM_MSCSET_CON0_SEL1_LEN (5u)

/** \brief  Mask for Ifx_GTM_MSCSET_CON0_Bits.SEL1 */
#define IFX_GTM_MSCSET_CON0_SEL1_MSK (0x1fu)

/** \brief  Offset for Ifx_GTM_MSCSET_CON0_Bits.SEL1 */
#define IFX_GTM_MSCSET_CON0_SEL1_OFF (8u)

/** \brief  Length for Ifx_GTM_MSCSET_CON0_Bits.SEL2 */
#define IFX_GTM_MSCSET_CON0_SEL2_LEN (5u)

/** \brief  Mask for Ifx_GTM_MSCSET_CON0_Bits.SEL2 */
#define IFX_GTM_MSCSET_CON0_SEL2_MSK (0x1fu)

/** \brief  Offset for Ifx_GTM_MSCSET_CON0_Bits.SEL2 */
#define IFX_GTM_MSCSET_CON0_SEL2_OFF (16u)

/** \brief  Length for Ifx_GTM_MSCSET_CON0_Bits.SEL3 */
#define IFX_GTM_MSCSET_CON0_SEL3_LEN (5u)

/** \brief  Mask for Ifx_GTM_MSCSET_CON0_Bits.SEL3 */
#define IFX_GTM_MSCSET_CON0_SEL3_MSK (0x1fu)

/** \brief  Offset for Ifx_GTM_MSCSET_CON0_Bits.SEL3 */
#define IFX_GTM_MSCSET_CON0_SEL3_OFF (24u)

/** \brief  Length for Ifx_GTM_MSCSET_CON1_Bits.SEL4 */
#define IFX_GTM_MSCSET_CON1_SEL4_LEN (5u)

/** \brief  Mask for Ifx_GTM_MSCSET_CON1_Bits.SEL4 */
#define IFX_GTM_MSCSET_CON1_SEL4_MSK (0x1fu)

/** \brief  Offset for Ifx_GTM_MSCSET_CON1_Bits.SEL4 */
#define IFX_GTM_MSCSET_CON1_SEL4_OFF (0u)

/** \brief  Length for Ifx_GTM_MSCSET_CON1_Bits.SEL5 */
#define IFX_GTM_MSCSET_CON1_SEL5_LEN (5u)

/** \brief  Mask for Ifx_GTM_MSCSET_CON1_Bits.SEL5 */
#define IFX_GTM_MSCSET_CON1_SEL5_MSK (0x1fu)

/** \brief  Offset for Ifx_GTM_MSCSET_CON1_Bits.SEL5 */
#define IFX_GTM_MSCSET_CON1_SEL5_OFF (8u)

/** \brief  Length for Ifx_GTM_MSCSET_CON1_Bits.SEL6 */
#define IFX_GTM_MSCSET_CON1_SEL6_LEN (5u)

/** \brief  Mask for Ifx_GTM_MSCSET_CON1_Bits.SEL6 */
#define IFX_GTM_MSCSET_CON1_SEL6_MSK (0x1fu)

/** \brief  Offset for Ifx_GTM_MSCSET_CON1_Bits.SEL6 */
#define IFX_GTM_MSCSET_CON1_SEL6_OFF (16u)

/** \brief  Length for Ifx_GTM_MSCSET_CON1_Bits.SEL7 */
#define IFX_GTM_MSCSET_CON1_SEL7_LEN (5u)

/** \brief  Mask for Ifx_GTM_MSCSET_CON1_Bits.SEL7 */
#define IFX_GTM_MSCSET_CON1_SEL7_MSK (0x1fu)

/** \brief  Offset for Ifx_GTM_MSCSET_CON1_Bits.SEL7 */
#define IFX_GTM_MSCSET_CON1_SEL7_OFF (24u)

/** \brief  Length for Ifx_GTM_MSCSET_CON2_Bits.SEL10 */
#define IFX_GTM_MSCSET_CON2_SEL10_LEN (5u)

/** \brief  Mask for Ifx_GTM_MSCSET_CON2_Bits.SEL10 */
#define IFX_GTM_MSCSET_CON2_SEL10_MSK (0x1fu)

/** \brief  Offset for Ifx_GTM_MSCSET_CON2_Bits.SEL10 */
#define IFX_GTM_MSCSET_CON2_SEL10_OFF (16u)

/** \brief  Length for Ifx_GTM_MSCSET_CON2_Bits.SEL11 */
#define IFX_GTM_MSCSET_CON2_SEL11_LEN (5u)

/** \brief  Mask for Ifx_GTM_MSCSET_CON2_Bits.SEL11 */
#define IFX_GTM_MSCSET_CON2_SEL11_MSK (0x1fu)

/** \brief  Offset for Ifx_GTM_MSCSET_CON2_Bits.SEL11 */
#define IFX_GTM_MSCSET_CON2_SEL11_OFF (24u)

/** \brief  Length for Ifx_GTM_MSCSET_CON2_Bits.SEL8 */
#define IFX_GTM_MSCSET_CON2_SEL8_LEN (5u)

/** \brief  Mask for Ifx_GTM_MSCSET_CON2_Bits.SEL8 */
#define IFX_GTM_MSCSET_CON2_SEL8_MSK (0x1fu)

/** \brief  Offset for Ifx_GTM_MSCSET_CON2_Bits.SEL8 */
#define IFX_GTM_MSCSET_CON2_SEL8_OFF (0u)

/** \brief  Length for Ifx_GTM_MSCSET_CON2_Bits.SEL9 */
#define IFX_GTM_MSCSET_CON2_SEL9_LEN (5u)

/** \brief  Mask for Ifx_GTM_MSCSET_CON2_Bits.SEL9 */
#define IFX_GTM_MSCSET_CON2_SEL9_MSK (0x1fu)

/** \brief  Offset for Ifx_GTM_MSCSET_CON2_Bits.SEL9 */
#define IFX_GTM_MSCSET_CON2_SEL9_OFF (8u)

/** \brief  Length for Ifx_GTM_MSCSET_CON3_Bits.SEL12 */
#define IFX_GTM_MSCSET_CON3_SEL12_LEN (5u)

/** \brief  Mask for Ifx_GTM_MSCSET_CON3_Bits.SEL12 */
#define IFX_GTM_MSCSET_CON3_SEL12_MSK (0x1fu)

/** \brief  Offset for Ifx_GTM_MSCSET_CON3_Bits.SEL12 */
#define IFX_GTM_MSCSET_CON3_SEL12_OFF (0u)

/** \brief  Length for Ifx_GTM_MSCSET_CON3_Bits.SEL13 */
#define IFX_GTM_MSCSET_CON3_SEL13_LEN (5u)

/** \brief  Mask for Ifx_GTM_MSCSET_CON3_Bits.SEL13 */
#define IFX_GTM_MSCSET_CON3_SEL13_MSK (0x1fu)

