luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_bf.h
/** \brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH5 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH5_OFF (13u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH6 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH6_LEN (1u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH6 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH6_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH6 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH6_OFF (14u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH7 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH7_LEN (1u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH7 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH7_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH7 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH7_OFF (15u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL0 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL0_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL0 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL0_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL0 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL0_OFF (16u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL1 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL1_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL1 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL1_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL1 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL1_OFF (18u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL2 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL2_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL2 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL2_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL2 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL2_OFF (20u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL3 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL3_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL3 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL3_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL3 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL3_OFF (22u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL4 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL4_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL4 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL4_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL4 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL4_OFF (24u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL5 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL5_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL5 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL5_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL5 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL5_OFF (26u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL6 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL6_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL6 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL6_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL6 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL6_OFF (28u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL7 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL7_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL7 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL7_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL7 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL7_OFF (30u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG0 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG0_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG0 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG0_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG0 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG0_OFF (0u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG1 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG1_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG1 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG1_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG1 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG1_OFF (2u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG2 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG2_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG2 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG2_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG2 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG2_OFF (4u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG3 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG3_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG3 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG3_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG3 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG3_OFF (6u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG4 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG4_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG4 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG4_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG4 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG4_OFF (8u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG5 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG5_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG5 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG5_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG5 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG5_OFF (10u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG6 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG6_LEN (2u)

